<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>


<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 2</h3>
    </div>
    <div class="panel-body">
        <p>Для таб­ли­цы ис­тин­но­сти функ­ции F из­вест­ны зна­че­ния толь­ко не­ко­то­рых ячеек:</p>
        <table class="table table-bordered">
            <thead>
                <tr>
                    <th>x1</th>
                    <th>x2</th>
                    <th>x3</th>
                    <th>x4</th>
                    <th>x5</th>
                    <th>x6</th>
                    <th>x7</th>
                    <th>F</th>
                </tr>
            </thead>
            <tbody>
            
            <tr>
            <td></td>
            <td></td>
            <td></td>
            <td>1</td>
            <td></td>
            <td>0</td>
            <td></td>
            <td>1</td>
            </tr>
            <tr>
            <td></td>
            <td></td>
            <td></td>
            <td>0</td>
            <td></td>
            <td></td>
            <td>0</td>
            <td>1</td>
            </tr>
            <tr>
            <td>0</td>
            <td></td>
            <td></td>
            <td>1</td>
            <td></td>
            <td></td>
            <td></td>
            <td>0</td>
            </tr>
            </tbody>
        </table>
    </div>
    <div class="panel-footer answers" data-id="2"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 3</h3>
    </div>
    <div class="panel-body">
        <p>В фраг­мен­те базы дан­ных пред­став­ле­ны све­де­ния о род­ствен­ных от­но­ше­ни­ях. На ос­но­ва­нии при­ведённых дан­ных опре­де­ли­те фа­ми­лию и ини­ци­а­лы род­ной сест­ры Ле­меш­ко В. А.</p>
        <div class="col-md-6">
            <b>Таблица 1</b>
            <table class="table table-bordered">
            <tbody>
            <tr>
            <td>ID</td>
            <td>Фа­ми­лия_И.О.</td>
            <td>Пол</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>Они­щен­ко А. Б.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1028</td>
            <td>Они­щен­ко Б. Ф.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1099</td>
            <td>Они­щен­ко И. Б.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1178</td>
            <td>Они­щен­ко П. И.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1056</td>
            <td>Они­щен­ко Т. И.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1065</td>
            <td>Кор­зун А. И.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>Кор­зун А. П.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1061</td>
            <td>Кор­зун Л. А.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1217</td>
            <td>Кор­зун П. А.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1202</td>
            <td>Зель­до­вич М. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1027</td>
            <td>Ле­меш­ко Д. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1040</td>
            <td>Ле­меш­ко В. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1046</td>
            <td>Месяц К. Г.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1187</td>
            <td>Лу­ки­на Р. Г.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1093</td>
            <td>Фокс П. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1110</td>
            <td>Друк Г. Р.</td>
            <td>Ж</td>
            </tr>
            </tbody>
            </table>
        </div>
        <div class="col-md-6">
            <b>Таблица 2</b>
            <table class="table table-bordered">
                <thead>
                    <tr>
                        <th>ID_Ро­ди­те­ля</th>
                        <th>ID_Ре­бен­ка</th>
                    </tr>
                </thead>
            <tbody>
            <tr>
            <td>1027</td>
            <td>1072</td>
            </tr>
            <tr>
            <td>1027</td>
            <td>1099</td>
            </tr>
            <tr>
            <td>1028</td>
            <td>1072</td>
            </tr>
            <tr>
            <td>1028</td>
            <td>1099</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>1040</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>1202</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>1217</td>
            </tr>
            <tr>
            <td>1099</td>
            <td>1156</td>
            </tr>
            <tr>
            <td>1099</td>
            <td>1178</td>
            </tr>
            <tr>
            <td>1110</td>
            <td>1156</td>
            </tr>
            <tr>
            <td>1110</td>
            <td>1178</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>1040</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>1202</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>1217</td>
            </tr>
            <tr>
            <td>1187</td>
            <td>1061</td>
            </tr>
            <tr>
            <td>1187</td>
            <td>1093</td>
            </tr>
            </tbody>
            </table>

        </div>
    </div>
    <div class="panel-footer answers" data-id="3"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 4</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="4"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>

