<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>


<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 2</h3>
    </div>
    <div class="panel-body">
        <p>Для таб­ли­цы ис­тин­но­сти функ­ции F из­вест­ны зна­че­ния толь­ко не­ко­то­рых ячеек:</p>
        <table class="table table-bordered">
            <thead>
                <tr>
                    <th>x1</th>
                    <th>x2</th>
                    <th>x3</th>
                    <th>x4</th>
                    <th>x5</th>
                    <th>x6</th>
                    <th>x7</th>
                    <th>F</th>
                </tr>
            </thead>
            <tbody>
            
            <tr>
            <td></td>
            <td></td>
            <td></td>
            <td>1</td>
            <td></td>
            <td>0</td>
            <td></td>
            <td>1</td>
            </tr>
            <tr>
            <td></td>
            <td></td>
            <td></td>
            <td>0</td>
            <td></td>
            <td></td>
            <td>0</td>
            <td>1</td>
            </tr>
            <tr>
            <td>0</td>
            <td></td>
            <td></td>
            <td>1</td>
            <td></td>
            <td></td>
            <td></td>
            <td>0</td>
            </tr>
            </tbody>
        </table>
    </div>
    <div class="panel-footer answers" data-id="2"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 3</h3>
    </div>
    <div class="panel-body">
        <p>В фраг­мен­те базы дан­ных пред­став­ле­ны све­де­ния о род­ствен­ных от­но­ше­ни­ях. На ос­но­ва­нии при­ведённых дан­ных опре­де­ли­те фа­ми­лию и ини­ци­а­лы род­ной сест­ры Ле­меш­ко В. А.</p>
        <div class="col-md-6">
            <b>Таблица 1</b>
            <table class="table table-bordered">
            <tbody>
            <tr>
            <td>ID</td>
            <td>Фа­ми­лия_И.О.</td>
            <td>Пол</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>Они­щен­ко А. Б.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1028</td>
            <td>Они­щен­ко Б. Ф.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1099</td>
            <td>Они­щен­ко И. Б.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1178</td>
            <td>Они­щен­ко П. И.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1056</td>
            <td>Они­щен­ко Т. И.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1065</td>
            <td>Кор­зун А. И.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>Кор­зун А. П.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1061</td>
            <td>Кор­зун Л. А.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1217</td>
            <td>Кор­зун П. А.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1202</td>
            <td>Зель­до­вич М. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1027</td>
            <td>Ле­меш­ко Д. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1040</td>
            <td>Ле­меш­ко В. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1046</td>
            <td>Месяц К. Г.</td>
            <td>М</td>
            </tr>
            <tr>
            <td>1187</td>
            <td>Лу­ки­на Р. Г.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1093</td>
            <td>Фокс П. А.</td>
            <td>Ж</td>
            </tr>
            <tr>
            <td>1110</td>
            <td>Друк Г. Р.</td>
            <td>Ж</td>
            </tr>
            </tbody>
            </table>
        </div>
        <div class="col-md-6">
            <b>Таблица 2</b>
            <table class="table table-bordered">
                <thead>
                    <tr>
                        <th>ID_Ро­ди­те­ля</th>
                        <th>ID_Ре­бен­ка</th>
                    </tr>
                </thead>
            <tbody>
            <tr>
            <td>1027</td>
            <td>1072</td>
            </tr>
            <tr>
            <td>1027</td>
            <td>1099</td>
            </tr>
            <tr>
            <td>1028</td>
            <td>1072</td>
            </tr>
            <tr>
            <td>1028</td>
            <td>1099</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>1040</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>1202</td>
            </tr>
            <tr>
            <td>1072</td>
            <td>1217</td>
            </tr>
            <tr>
            <td>1099</td>
            <td>1156</td>
            </tr>
            <tr>
            <td>1099</td>
            <td>1178</td>
            </tr>
            <tr>
            <td>1110</td>
            <td>1156</td>
            </tr>
            <tr>
            <td>1110</td>
            <td>1178</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>1040</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>1202</td>
            </tr>
            <tr>
            <td>1131</td>
            <td>1217</td>
            </tr>
            <tr>
            <td>1187</td>
            <td>1061</td>
            </tr>
            <tr>
            <td>1187</td>
            <td>1093</td>
            </tr>
            </tbody>
            </table>

        </div>
    </div>
    <div class="panel-footer answers" data-id="3"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 4</h3>
    </div>
    <div class="panel-body">
        <p>Для каж­до­го из пе­ре­чис­лен­ных ниже чисел по­стро­и­ли дво­ич­ную за­пись. Ука­жи­те число, дво­ич­ная за­пись ко­то­ро­го со­дер­жит ровно две еди­ни­цы. Если таких чисел не­сколь­ко, ука­жи­те наи­боль­шее из них.</p>
    </div>
    <div class="panel-footer answers" data-id="4"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 5</h3>
    </div>
    <div class="panel-body">
        <p>В таб­ли­цах при­ве­де­на про­тя­жен­ность ав­то­ма­ги­стра­лей между со­сед­ни­ми на­се­лен­ны­ми пунк­та­ми. Если пе­ре­се­че­ние стро­ки и столб­ца пусто, то со­от­вет­ству­ю­щие на­се­лен­ные пунк­ты не со­еди­не­ны ав­то­ма­ги­стра­ля­ми. Ука­жи­те номер таб­ли­цы, для ко­то­рой вы­пол­ня­ет­ся усло­вие «Мак­си­маль­ная про­тя­жен­ность марш­ру­та от пунк­та А до пунк­та С не боль­ше 5». Про­тя­жен­ность марш­ру­та скла­ды­ва­ет­ся из про­тя­жен­но­сти ав­то­ма­ги­стра­лей между со­от­вет­ству­ю­щи­ми со­сед­ни­ми на­се­лен­ны­ми пунк­та­ми. При этом любой на­се­лен­ный пункт дол­жен встре­чать­ся на марш­ру­те не более од­но­го раза.</p>
        <div class="row">
            <div class="col-md-3">
                <b>1</b>
                <img src="content/test/05/1.png" alt="">
            </div>
            <div class="col-md-3">
                <b>2</b>
                <img src="content/test/05/2.png" alt="">
            </div>
            <div class="col-md-3">
                <b>3</b><img src="content/test/05/3.png" alt="">
            </div>
            <div class="col-md-3">
                <b>4</b>
                <img src="content/test/05/4.png" alt="">
            </div>
        </div>
    </div>
    <div class="panel-footer answers" data-id="5"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 6</h3>
    </div>
    <div class="panel-body">
        <p>У ис­пол­ни­те­ля Квадр две ко­ман­ды, ко­то­рым при­сво­е­ны но­ме­ра:</p>
        <ol>
            <li>при­бавь 1</li>
            <li>воз­ве­ди в квад­рат</li>
        </ol>
        <p>Пер­вая из этих ко­манд уве­ли­чи­ва­ет число на экра­не на 1, вто­рая — воз­во­дит в квад­рат. Про­грам­ма для ис­пол­ни­те­ля Квадр — это по­сле­до­ва­тель­ность но­ме­ров ко­манд.</p>
        <p>На­при­мер, 22111 — это про­грам­ма</p>
        <ul>
            <li>воз­ве­ди в квад­рат</li>
            <li>воз­ве­ди в квад­рат</li>
            <li>при­бавь 1</li>
            <li>при­бавь 1</li>
            <li>при­бавь 1</li>
        </ul> 
        <p>Эта про­грам­ма пре­об­ра­зу­ет число 3 в число 84.</p>
        <p>За­пи­ши­те про­грам­му для ис­пол­ни­те­ля Квадр, ко­то­рая пре­об­ра­зу­ет число 5 в число 2500 и со­дер­жит не более 6 ко­манд. Если таких про­грамм более одной, то за­пи­ши­те любую из них.</p>
    </div>
    <div class="panel-footer answers input" data-id="6"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 7</h3>
    </div>
    <div class="panel-body">
        <p>Дан фраг­мент элек­трон­ной таб­ли­цы. Из ячей­ки D2 в одну из ячеек диа­па­зо­на E1:E4 была ско­пи­ро­ва­на фор­му­ла. При ко­пи­ро­ва­нии ад­ре­са ячеек в фор­му­ле ав­то­ма­ти­че­ски из­ме­ни­лись, и зна­че­ние фор­му­лы стало рав­ным 8. В какую ячей­ку была ско­пи­ро­ва­на фор­му­ла? В от­ве­те ука­жи­те толь­ко одно число – номер стро­ки, в ко­то­рой рас­по­ло­же­на ячей­ка.</p>
        <table class="table table-bordered">
            <thead>
                <tr>
                    <th></th>
                    <th>A</th>
                    <th>B</th>
                    <th>C</th>
                    <th>D</th>
                    <th>E</th>
                </tr>
            </thead>
        <tbody>
        <tr>
        <td>1</td>
        <td>1</td>
        <td>2</td>
        <td>3</td>
        <td>4</td>
        <td></td>
        </tr>
        <tr>
        <td>2</td>
        <td>2</td>
        <td>3</td>
        <td>4</td>
        <td>= B$3 + $C2</td>
        <td></td>
        </tr>
        <tr>
        <td>3</td>
        <td>3</td>
        <td>4</td>
        <td>5</td>
        <td>6</td>
        <td></td>
        </tr>
        <tr>
        <td>4</td>
        <td>4</td>
        <td>5</td>
        <td>6</td>
        <td>7</td>
        <td></td>
        </tr>
        </tbody>
        </table>
    </div>
    <div class="panel-footer answers input" data-id="7"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>
<div class="panel panel-default task">
    <div class="panel-heading">
        <h3 class="panel-title">Задание 1</h3>
    </div>
    <div class="panel-body">
        <p>Для ко­ди­ро­ва­ния букв Д, X, Р, О, В ре­ши­ли ис­поль­зо­вать дво­ич­ное пред­став­ле­ние чисел 0, 1, 2, 3 и 4 со­от­вет­ствен­но (с со­хра­не­ни­ем од­но­го не­зна­ча­ще­го нуля в слу­чае од­но­раз­ряд­но­го пред­став­ле­ния). Если за­ко­ди­ро­вать по­сле­до­ва­тель­ность букв ХО­РО­ВОД таким спо­со­бом и ре­зуль­тат за­пи­сать вось­ме­рич­ным кодом, то по­лу­чит­ся</p>
    </div>
    <div class="panel-footer answers" data-id="1"></div>
</div>

